In [20]:
import numpy as np
import pandas as pd

In [21]:
s1=np.random.randint(1,10,5)
s2=np.random.randint(1,10,5)
s3=np.random.randint(1,10,5)

In [22]:
dict={"var1":s1,"var2":s2,"var3":s3}
dict

{'var1': array([7, 4, 3, 9, 2]),
 'var2': array([6, 1, 4, 2, 9]),
 'var3': array([3, 6, 5, 3, 6])}

In [23]:
df=pd.DataFrame(dict)
df

   var1  var2  var3
0     7     6     3
1     4     1     6
2     3     4     5
3     9     2     3
4     2     9     6

In [24]:
df[0:2]

   var1  var2  var3
0     7     6     3
1     4     1     6

In [25]:
df.index=["value1","value2","value3","value4","value5"]

In [26]:
df

        var1  var2  var3
value1     7     6     3
value2     4     1     6
value3     3     4     5
value4     9     2     3
value5     2     9     6

In [28]:
df["value2":"value4"]

        var1  var2  var3
value2     4     1     6
value3     3     4     5
value4     9     2     3

### silme drop fonk kullanılır. silmeyi kalıcı hale getirmrk için inplace arg. true yapılmalı

In [32]:
df.drop("value1",inplace=True)

In [33]:
df.drop("var1",axis=1)

        var2  var3
value2     1     6
value3     4     5
value4     2     3
value5     9     6

In [34]:
df

        var1  var2  var3
value2     4     1     6
value3     3     4     5
value4     9     2     3
value5     2     9     6

In [37]:
df.drop(["value3","value4"],axis=0)

        var1  var2  var3
value2     4     1     6
value5     2     9     6

In [41]:
l=["var1","var4","var2"]
for i in l:
    print(i in df)

True
False
True

In [48]:
df["var4"]=df["var1"]*df["var3"]
df

        var1  var2  var3  var4
value2     4     1     6    24
value3     3     4     5    15
value4     9     2     3    27
value5     2     9     6    12

In [52]:
df["var4"]

value2    24
value3    15
value4    27
value5    12
Name: var4, dtype: int32